{
  "id": 4470,
  "source": "Hacker News",
  "title": "Full Disclosure: A Third (and Fourth) Azure Sign-In Log Bypass Found",
  "url": "https://trustedsec.com/blog/full-disclosure-a-third-and-fourth-azure-sign-in-log-bypass-found",
  "published_at": "2026-03-20T01:09:45Z",
  "fetched_at": "2026-03-20T02:20:06.756053+00:00",
  "author": null,
  "summary": "<a href=\"https://news.ycombinator.com/item?id=47448994\">Comments</a>",
  "full_text": "Invisible password sprays. Invisible logins. Full tokens returned.\n\nNyxgeek here. It's 2026 and I've got two more Azure Entra ID sign-in log bypasses to share with you. Don't get too excited…these bypasses were recently fixed, but I think it's important that people know.\n\nBy sending a specially crafted login attempt to the Azure authentication endpoint, it was possible to retrieve valid tokens without the activity appearing in the Entra ID sign-in logs. This is critical logging…logging that administrators across the world rely on to detect intrusions…logging that could be made optional.\n\nToday I will walk you through the third and fourth Azure sign-in log bypasses that I have found in the last three years. I will also look at how sign-in log bypasses can be detected using KQL queries. By knowing about Microsoft's past mistakes, we can try to prepare for their future failures.\n\nBackground\n\nSince 2023, I've uncovered four Azure Entra ID sign-in log bypasses. This means I've found four completely different ways to validate an Azure account's password without it showing up in the Azure Entra ID sign-in logs. While the first two of these merely confirmed whether a password was valid without generating a log, my latest logging bypasses returned fully functioning tokens.\n\nPreviously, I had written about GraphNinja and GraphGhost -- two logging bypasses where a user could identify valid passwords without generating any 'successful' events in the sign-in logs. Neither were overly complicated. You can find blog posts describing them in detail here and here.\n\nName\n\nReported\n\nFixed\n\nDescription\n\nGraphNinja\n\n08/2023\n\n05/2024\n\nValidate password without creating a log by specifying a foreign tenant ID as endpoint\n\nGraphGhost\n\n12/2024\n\n04/2025\n\nValidate password without creating a successful login event by supplying an invalid value for specific logon parameters, causing overall auth flow to fail after performing credential validation\n\nReal quick -- a point of clarification on the names: while I've used Graph- prefix to designate these different bypasses, perhaps it would have been more appropriate to prefix them Entra-, as they were not limited to only Graph sign-ins.\n\nIn each of these, the logging being bypassed is for the Azure Entra ID sign-in logs. Logon method is via an HTTP POST to the Entra ID token endpoint, login.microsoftonline.com, using the OAuth2 ROPC flow, with the Graph API as our intended resource/scope. We submit a username and password, an Application ID, and a target resource/scope, and we'll get a bearer token or refresh token for the Graph API in return.\n\nAn example curl command performing a \"normal\" authentication can be seen below:curl -X POST \"https://login.microsoftonline.com/00000000-1234-1234-1234-000000000000/oauth2/v2.0/token\" \\\n -H \"Content-Type: application/x-www-form-urlencoded\" \\\n --data-urlencode \"client_id=f05ff7c9-f75a-4acd-a3b5-f4b6a870245d\" \\\n --data-urlencode \"client_info=1\" \\\n --data-urlencode \"grant_type=password\" \\\n --data-urlencode \"[email protected]\" \\\n --data-urlencode \"password=secretpassword123\" \\\n --data-urlencode \"scope=https://graph.microsoft.com/.default\"\n\nWhen a valid username and password are supplied, a token is returned that can be used to access the Graph API.\n\nGraphNinja Recap\n\nIn the GraphNinja bypass, it was only necessary to target another tenant with the authentication attempt (e.g., https://login.microsoftonline.com/00000000-1234-1234-1234-000000000000/oauth2/v2.0/token). Any other valid tenant GUID would do, as long as it wasn't your victim's. The authentication response would still indicate if a valid password was found, but the login would fail because it was performed against a foreign tenant where the user didn't exist. No failed or successful authentication log was generated within the parent tenant of the actual user, as the authentication was targeting the foreign tenant. No logs were generated on the foreign tenant because only logs for valid users within that tenant are generated, and the target user did not exist within the foreign tenant. While no token was returned by GraphNinja, it would indicate to an attacker whether the password was valid without the attempt appearing in logs. Additional logging was added by Microsoft to remediate this oversight.\n\nGraphGhost Recap\n\nWith the GraphGhost bypass, providing an invalid Client ID value would cause the overall authentication flow to fail, but not until after credential validation had occurred. By providing an invalid value for the Client ID, it would fail a post-password-validation step, the overall authentication flow would fail, and this would show to administrators as a failed login, with no indication in logs that the password had been successfully guessed. Like GraphNinja, no token was returned, but the password was validated without any indication to the admin. This issue was fixed by Microsoft with the addition of details in the sign-in logs to indicate whether the password was successful.\n\nFigure 1 - Previously Identified Failures\n\nNow that you're caught up on what's been found in 2023 and 2024, let's look at the findings from 2025.\n\nEnter GraphGoblin and Graph******\n\nGraphGoblin Bypass\n\nLet's start with what I'm terming GraphGoblin. I stumbled across this bypass while poking at the parameters in the Microsoft authentication POST. Testing the scope parameter, I first tried some simple things like supplying invalid scope values. However, I found that the scope value would be rejected if it wasn't a valid scope name, or didn't match an expected format.\n\nFigure 2 - Scope is Validated\n\nInvalid scopes returned an error:\n\nAADSTS70011: The provided request must include a 'scope' input parameter. The provided value for the input parameter 'scope' is not valid. The scope [scope] is not valid. The scope format is invalid. Scope must be in a valid URI form <https://example/scope> or a valid Guid <guid/scope>.\n\nThis error message isn't 100% honest. You can also just specify specific scopes, such as openid or Directory.Read.All. If the URL or GUID format is used, it will validate the resource being targeted, and then the scope. This validation of the scope values prevented arbitrary long strings from being evaluated.\n\nOr did it? What if the string we submitted WAS valid, but repeating? For instance, instead of specifying a value like openid as the scope, what if we submitted a bunch of the same value, like openid openid openid?\n\nFigure 3 - Overflowing the Scope\n\nIt got through! But did it work at bypassing the logs? I set an alarm for 15 minutes, came back, and checked the Azure Entra ID sign-in logs, and found NO NEW SIGN-INS! W00t! I waited another 15 minutes before really celebrating. Then I tested it with a friend's tenant, just to be sure. It was a solid bypass.\n\nTo show how dead-simple this is, a demonstration of this bypass using curl and Bash expansion can be found below:export TENANT_ID=\"[tenant-guid-goes-here]\"\ncurl -X POST \"https://login.microsoftonline.com/${TENANT_ID}/oauth2/v2.0/token\" \\\n -H \"Content-Type: application/x-www-form-urlencoded\" \\\n --data-urlencode \"client_id=f05ff7c9-f75a-4acd-a3b5-f4b6a870245d\" \\\n --data-urlencode \"client_info=1\" \\\n --data-urlencode \"grant_type=password\" \\\n --data-urlencode \"[email protected]\" \\\n --data-urlencode \"password=secretpassword123\" \\\n --data-urlencode \"scope=$(for num in {1..10000}; do echo -n 'openid ';done)\"\n\nWhy it Worked (Maybe)\n\nThere is no way of knowing 100% why this worked without Microsoft publishing information about these issues, but I can take a guess.\n\nHaving done a fair bit of logging to databases with various scripts, I believe this was a simple matter of overflowing the SQL column length for a field, causing the entire INSERT to fail. This is a common beginner mistake when you first start to work with databases.\n\nIt's likely that the parser iterated over the list of scopes included, did not find any invalid ones, and so allowed the repetitious entry to pass and attempted to log the raw list of openid openid openid…, in its entirety, overflowing the limit of that SQL column. In testing, a reasonable max length could be assumed to be the sum of the length of all possible scope names. Perhaps they tested for that scenario but never anticipated the repeats. At any rate, if this was the case, they failed to perform simple tests against user-supplied data.\n\nIf Microsoft wants to speak publicly about this, I'd love to hear more on it, and to know more about how they approach internal security reviews of their most-critical products.\n\nGraphGoblin Video Demo\n\nIt's not often that you see a demo of an actual Azure vulnerability, as they get patched and are gone forever. However, because Microsoft was having trouble replicating this complicated bypass, and asked for a video, I come bearing receipts.\n\nFor your viewing pleasure, I present to you what is probably the only Azure sign-in log bypass you'll ever see:\n\nGraphGoblin Demo - Screenshots and Logs\n\nI've also included a traditional walkthrough below…\n\nIn the following demo I am about to perform a series of three login attempts.\nThe first attempt will be a failed login that generates a normal failed sign-in log. This failed sign-in also generates a 'Correlation ID' that we can use as a reference point in our logs.\nIn the second attempt, I'll authenticate using the GraphGoblin sign-in log bypass technique.\nThen, I'll make one final normal failed attempt, so we have another Correlation ID as a marker.\n\nIf all of the following attempts are properly logged, the sign-in logs should show:\nFailed Login\nSuccessful Login\nFailed Login\n\nBelow is a screenshot of the Entra ID sign-in logs. Note the Correlation ID of the last log, and the time. It is dated 9/20/2025, at 1:49:20 PM, with a Correlation ID starting with 1dfe62e9-.\n\nFigure 4 - Take Note of our Most Recent Log Time and ID\n\nIn the screenshot below, you can see the source of that failed login; note that the time and Correlation ID match.\n\nFigure 5 - First and Second Logons\n\nIn the above image, below the failed login, you can see a valid login and a timestamp. The valid login occurs on 9/20/2025 at 13:52:38. The difference is, this time, I'm using the GraphGoblin bypass that will make this login event invisible. The login is successful and we can see a bearer token is returned.\n\nIn the following screenshot, I export the token to the variable TOKEN so we can easily use it with curl. I then demonstrate that the token is valid by making a Graph API request with it.\n\nFigure 6 - Using Graph Token\n\nNow, to make it clear when reviewing logs, I'm going to make an invalid login attempt, without the bypass. This will give us a Correlation ID to use as another marker point.\n\nFigure 7 - Third Logon\n\nNote that the attempt is from 9/20/2025 at 19:01:45 and has a Correlation ID that starts with 0d5ea4f0-. As a reminder, the first failed login had a Correlation ID that starts with 1dfe62e9-.\n\nIf we wait 10 minutes for logs to ingest then review the logs, we see our Correlation ID starting with 0d5ea4f0- is directly after our previous failed login with an ID that starts with 1dfe62e9-. No successful login is shown.\n\nFigure 8 - End Marker With No Successful Login Between\n\nI then make a NORMAL valid login, without the logging bypass, to show that logs are still flowing.\n\nFigure 9 - Final Normal Logon\n\nAnd, we can see the regular, successful authentication come in, but still no sign of the GraphGoblin method.\n\nFigure 10 - No Sign of the GraphGoblin\n\nAdditional Logging Information\n\nAfter posting a video of the bypass to Twitter/X a while back, people were curious if it was a matter of the sign-in logs not displaying them in the Azure portal GUI, or if it was truly being dropped.\n\nReviewing the log analytics, I can confidently say that these were dropped entirely from the sign-in logs. In the demo video, I had sent a normal request with a user-agent of MARKER 1 – BEFORE THE BYPASS. After performing multiple authentications using the logging bypasses, I sent another normal request with a user-agent of MARKER 2 – AFTER THE BYPASS. In my Log Analytics workspace, we can see that none of the bypassed sign-in logs made it to Log Analytics. Only our MARKER 1 and MARKER 2 entries are visible from our tests.\n\nFigure 11 - Confirming the Bypass Extends to Log Analytics\n\nGraph****** Bonus Bypass!\n\nOkay, so I mentioned that I had found a FOURTH bypass. This one was ridiculously simple, and it's related to GraphGoblin. Can you guess what logon parameter was vulnerable?\n\nI'll give you a hint: This field is customized regularly.\n\nAnother hint: If you were going to perform fuzzing of a critical web-based authentication system and its logging, you would DEFINITELY want to include this field in your testing.\n\nDid you guess it? If you guessed the USER-AGENT field, you're RIGHT!\n\nThe secret to abusing this field so that it wouldn't generate an authentication log? You make the user-agent string really long. A total of 50,000 characters in the user-agent worked reliably. That's it. No special trick, just a long string.\n\nHere is a screenshot of the bypass in action:\n\nFigure 12 - Bypassing Logging With 50,000 Character User-Agent\n\nAgain, I would guess this was the result of overflowing a SQL column limit.\n\nHere is a screenshot where I made a failed login to generate a Correlation ID that starts with c542178e:\n\nFigure 13 - Correlation ID of Failed Graph****** Login\n\nAnd here is a screenshot of a search in my logs from October 09, 2025, looking for that Correlation ID in the last month's logs. As you can see, no log with the Correlation ID was found, indicating the bypass was successful.\n\nFigure 14 - No Correlation ID in Logs\n\nI discovered this on 9/28/2025, and a week later when I went back to write up a report on it, Microsoft had already fixed it! I'm not sure how they noticed and fixed this issue without also noticing and fixing GraphGoblin, but they did.\n\nTimeline\n9/20/2025 Initial discovery of GraphGoblin\n9/26/2025 Initial disclosure of GraphGoblin to MSRC\n9/28/2025 Initial discovery of Graph******\n10/8/2025 Graph****** fixed by Microsoft prior to reporting\n11/7/2025 Microsoft is unable to reproduce this so I make them a video\n11/21/2025 Finally reproduce and start to roll out fix\n12/1/2025 Re-escalated within MSRC re: bounty and severity, no change\n\nWhat's going on here, Microsoft?\n\nTo review, here are the parts of a logon POST that had flaws that enabled the Azure Entra ID sign-in log bypasses. I've compiled them into one screenshot so you can see how many login parameters have had issues identified.\n\nFigure 15 - Four Bypasses in Three Years\n\nThis is the gatehouse that secures hundreds, even thousands, of organizations. How is it possible that so many parts of this critical feature were so woefully untested? None of the bypasses that I've submitted these last few years were complicated. Yet, somehow, Microsoft's security review of Entra ID missed all of them.\n\nFigure 16 - Yikes\n\nWere issues introduced with AI coding? Anybody who has worked with AI for coding knows that it 100% can (and often will) drop portions of your code when revising it. Or did these issues get introduced slowly over the years? Or, have these problems all been there since the start of Azure over a decade ago? Unfortunately, we will never know. Again, I invite Microsoft to speak publicly on these repeated failings.\n\nDetecting Sign-In Log Bypasses - A Futureproof Solution\n\nFour sign-in log bypasses in the last three years, for what is arguably the most important log of all of Azure. This doesn't bode well for admins who rely on these logs as a source of truth. So what can you do, short of moving back to on prem? Well, if you shell out the cash for an E5 license, you can still detect malicious activity, in spite of Microsoft's failures.\n\nKQL Detections\n\nAfter finding these last two bypasses, I started to see if I could identify traffic from these bypassed sessions. I had been collecting Graph activity in a Log Analytics workspace along with Sign-In logs. While reviewing logs I noticed that the Sign-In logs and the Graph Activity logs both had a Session ID field. Perfect! It should be possible to take a list of all unique Session IDs from the Graph Activity logs and find a corresponding Session ID in the sign-in logs. Any Session IDs that only show up in the Graph Activity logs, and don't exist in any sign-in logs, must have bypassed the sign-in logs. Note for defenders: you will need an E5 license to collect the Graph Activity logs.\n\nI started off with a simple query, ran it on my small test tenant, and voilà! I had a list of Graph activity belonging to my bypassed sessions.\n\nFigure 17 - Detecting Graph Activity for Bypassed Sessions\n\nHowever, it soon became apparent, when testing the detection with a client at a larger organization, that there was a lot of possible 'noise' to account for. My simple checks didn't take into account noninteractive logins, nor service principal logins.\n\nFor a while, I was at an impasse. However, I soon found that somebody else had already thought of this, and had implemented it! Fabian Bader has a post covering exactly this in his fantastic write-up, Detect threats using Microsoft Graph activity logs - Part 2.\n\nThere is an entire section on finding missing sign-in logs!\n\nFigure 18 - Excellent Detection Post by Bader\n\nThis method incorporates additional sources of sign-ins that I had not, including from service principals, managed identities, and noninteractive user sign-ins. Instead of joining on SessionId values, this KQL performs the JOIN on the more fine-grained properties – GraphActivity.SignInActivityId <-> SignInLogs.UniqueTokenIdentifier.\n\nI still had a little bit of noise, but I added the MicrosoftServicePrincipalSignInLogs to the list of Sign-In sources and it mostly cleared up.MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(8d)\n| join kind=leftanti (union isfuzzy=true\n SigninLogs,\n AADNonInteractiveUserSignInLogs,\n AADServicePrincipalSignInLogs,\n AADManagedIdentitySignInLogs,\n MicrosoftServicePrincipalSignInLogs\n | where TimeGenerated > ago(90d)\n | summarize arg_max(TimeGenerated, *) by UniqueTokenIdentifier\n )\n on $left.SignInActivityId == $right.UniqueTokenIdentifier \n\nIf the above query returns false-positives, you might want to experiment with matching on the broader matching variable, SessionId instead:MicrosoftGraphActivityLogs\n| where TimeGenerated > ago(8d)\n| join kind=leftanti (union isfuzzy=true\n SigninLogs,\n AADNonInteractiveUserSignInLogs,\n AADServicePrincipalSignInLogs,\n AADManagedIdentitySignInLogs,\n MicrosoftServicePrincipalSignInLogs\n | where TimeGenerated > ago(90d)\n | summarize arg_max(TimeGenerated, *) by UniqueTokenIdentifier\n )\n on $left.SessionId == $right.SessionId \n\nIf you get it tuned so that you're not getting false alerts, you may want to create an Azure Log Search Alert Rule to notify you if one appears.\n\nI highly recommend checking out the rest of Bader's blog for more detection ideas, as that post is part of a three-blog series.\n\nDenied by MSRC\n\nIn a completely unexpected turn of events, Microsoft informed me that they did not consider this to be an 'Important' issue, but merely a 'Moderate' security problem. Therefore, it would not be eligible for any acknowledgement or reward.\n\nI was shocked. They had given me bounties the two previous times I identified Azure Entra Sign-In log bypasses, and for less functional bypasses at that.\n\nHere I had a sign-in log bypass, affecting the most critical of all Azure logs, which resulted in a full token, and Microsoft is saying that it's not important. Take note of that, admins and IT managers. This is how Microsoft views the most important security log in your organization, and a primary source of truth for those without E5 licenses and advanced logging.\n\nFigure 19 - ...\n\nHow Does it Score?\n\nWhen submitting to Microsoft, they ask for your assessment of its CVSS score. Here is my assessment of the scoring, and the reasons for it. If you'd rather skip the nerd-out, go ahead to the detection section below.\n\nFor scoring, I used CVSS v3.1:\n\nMetric\n\nRating\n\nNotes\n\nAttack Vector\n\nNetwork\n\nVia an HTTP POST\n\nAttack Complexity\n\nLow\n\nCan exploit it with curl\n\nPrivileges Required\n\nNone\n\nWill hide both failed and successful sign-in logs\n\nUser Interaction\n\nNone\n\n \n\nScope\n\nUnchanged\n\n \n\nConfidentiality\n\nNone\n\nNot impacted\n\nIntegrity\n\nHigh\n\nA critical log is bypassed - see note below\n\nAvailability\n\nNone\n\nNot impacted\n\nThe Integrity rating is the heart of this, and it's why this should be rated as 'Important' in Microsoft's vernacular. If we consult the CVSS v3.1 documentation, we can see that they give examples of what would constitute Low or High for the Integrity metric.\n\nFigure 20 - CVSS v3.1 Guidance on Integrity Rating\n\nDescribing a High value for the Integrity metric, the guidance notes:\n\"There is a total loss of integrity, or a complete loss of protection. For example, the attacker is able to modify any/all files protected by the impacted component. Alternatively, only some files can be modified, but malicious modification would present a direct, serious consequence to the impacted component.\"\n\nHere we are modifying the Azure Entra ID sign-in logs by causing our logs to be omitted. The modification of these sign-in logs presents a direct, serious consequence to the impacted component.\n\nPutting that all into the calculator, we see it comes out as a High, with a 7.5 CVSS v3.1 score.\n\nFigure 21 - CVSS v3.1 Score of 7.5\n\nIf it were for almost any other log, I could understand a Low Integrity rating. But this isn't just any log. This is the Azure Entra ID sign-in log, arguably the most important log in all of Azure. The CVSS standard specifically cites this as an example of when it would make an otherwise Low rating into a High.\n\nFigure 22 - It's a Big Deal!\n\nIf we compute it in CVSS v4.0, which contains the same language for the Integrity metric, we come out with an even higher rating of 8.7.\n\nFigure 23 - CVSS v4.0 Score of 8.7\n\nUrgency of Fix\n\nDespite Microsoft claiming this was not 'Important' in severity, they fixed it in record time. While they had trouble reproducing the exploit at first, after providing them with a video demo and my tooling, they had the issue fixed within TWO WEEKS. For reference, GraphNinja took them seven months, and GraphGhost took five.\n\nMSRC Inconsistencies\n\nPerhaps the worst aspect is the inconsistency. You have absolutely no idea what they're going to do, no idea how they're going to perceive your issue (or what their grasp of it is), and no guarantees if you'll get anything for your trouble and troubleshooting.\n\nThe Four Bypasses\n\nBelow is a table describing the four bypasses that I've identified and how MSRC handled them. None of the sign-in log bypasses were publicly acknowledged by Microsoft.\n\nName\n\nFixed\n\nDescription\n\nToken Issued?\n\nPoints?\n\nBounty?\n('Important' or higher)\n\nGraphNinja\n\n05/2024\n\nValidate password without creating a log by specifying a foreign tenant ID as endpoint\n\nNo\n\nNo\n\nYes\n\nGraphGhost\n\n04/2025\n\nValidate password without creating a successful login event by supplying an invalid value for specific logon parameters\n\nNo\n\nYes\n\nYes\n\nGraphGoblin\n\n11/21/2025\n\nGet a token without creating a log by repeating a valid parameter value 35,000 times, overflowing the table column\n\nYes\n\nNo\n\nNo\n\nGraph******\n\n10/9/2025\n\n(fixed before I could submit)\n\nGet a token without creating a log by specifying a very long user-agent string, overflowing the table column\n\nYes\n\nN/A\n\nN/A\n\nDespite GraphGoblin retrieving a full token, they have now decided that these are not 'Important'.\n\nGoing Forward\n\nIn the beginning, Microsoft gave out CVEs, and it was good. CVEs > bounties because CVEs are for life. I got a couple CVEs for Skype for Business and Lync for Mac in 2017 and 2018, but no bounties. Then, Microsoft slowed down on giving CVEs but started to give bounties. No CVEs for cloud stuff, and only for High or Critical-Severity. This was not as good, but I have realized that I have certain materialistic needs, so cash was fine.\n\nFigure 24 - CVE >$$ Still\n\nBut now, Microsoft is giving me nothing. No bounty. No fake points on their fake point board. No acknowledgement even. Microsoft is the CNA and they get to decide what is a vuln and what isn't, and there's no real recourse that I'm aware of. It's a convenient arrangement, allowing them to decide which of their failings get publicity, and which can be swept under a rug.\n\nTheir backpedaling on whether this issue is classified as 'Important' is disheartening. I will say that if they had not given a bounty on that initial GraphNinja bypass, I don't know that I would have put the same time and effort into finding others. We all have busy lives, myself included. If they hadn't paid that first bounty, there is a real possibility that 3 unfound bypasses would be waiting for an adversary to pick up.\n\nIn closing, I'd like you to look at this screenshot again, and note the failures that were found affecting the Entra sign-in logging over these last few years.\n\nFigure 25 - Four Bypasses in Three Years\n\nThese were not complicated logging bypasses. These were all the result of simple fuzzing. Furthermore, this wasn't just any logging being bypassed, but a critical log essential to the security of the entire Azure tenant. A log that feeds into SIEMs and is used as a source of truth to detect intruders. How did these serious security flaws get introduced? How long were they there for? Why were they not caught by Microsoft's own reviews? Nearly all of America uses Azure. Many parts of the world use Azure. We have collectively placed our trust in Microsoft and their security practices. When there's a problem that impacts this many users, I believe that Microsoft has an obligation to inform the public at large. Unfortunately, we're not seeing that.\n\nFigure 26 - Sayonara MSRC",
  "tags": [
    "3000+-words",
    "azure",
    "azure entra",
    "bypasses",
    "correlation id",
    "entra",
    "entra id",
    "failed",
    "figure",
    "fourth azure",
    "full disclosure",
    "graph",
    "log",
    "login",
    "logs",
    "microsoft",
    "security",
    "sign in",
    "third",
    "valid"
  ]
}